package com.bookkeeping.controller;

public class FinanceController {
    /*4、获取账单
    参数：时间周期，时间
    返回值：支出、收入、结余
            list
    5、统计图表数据
    参数：时间周期，时间
    返回值：支出(累计，平均)、收入(累计，平均)、结余
            支出list
    收入list
    6、分类图表数据
    参数：时间周期，时间
    返回值：支出、收入
            支出list
    收入list
    7、趋势图表数据
    参数：时间，收支类别，分类类别
    返回值：累计、平均、最高
            支出或收入list
    8、获取二级分类
    参数：
    返回值：
            9、记账
    参数：二级分类、时间、金额、备注
    返回值：成功失败
    10、编辑
    参数：二级分类、时间、金额、备注
    返回值：成功失败
    11、删除
    参数：数据ID
    返回值：成功失败*/
}
